In [53]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model

In [54]:
df=pd.read_csv("titanic_NB.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [55]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Fare','Cabin','Embarked'],axis=1,inplace=True)
df.head()

   Pclass     Sex   Age  Survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

In [56]:
target=df.Survived
inputs=df.drop(['Survived'],axis='columns')

In [57]:
dummies=pd.get_dummies(inputs['Sex'])
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [63]:
d1=pd.concat([inputs,dummies],axis=1)
d1.head()

   Pclass     Sex   Age  female  male
0       3    male  22.0       0     1
1       1  female  38.0       1     0
2       3  female  26.0       1     0
3       1  female  35.0       1     0
4       3    male  35.0       0     1

In [64]:
d1.drop(['Sex'],axis=1,inplace=True)
d1.head()

   Pclass   Age  female  male
0       3  22.0       0     1
1       1  38.0       1     0
2       3  26.0       1     0
3       1  35.0       1     0
4       3  35.0       0     1

In [66]:
d1.columns[d1.isnull().any()]

Index(['Age'], dtype='object')

In [67]:
d1.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [68]:
mean=d1.Age.mean()

In [69]:
d1.Age=d1.Age.fillna(mean)
d1.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [70]:
d1.head()

   Pclass   Age  female  male
0       3  22.0       0     1
1       1  38.0       1     0
2       3  26.0       1     0
3       1  35.0       1     0
4       3  35.0       0     1

In [83]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split(d1,target,test_size=0.2)

In [84]:
len(X_train)

712

In [85]:
len(X_test)

179

In [86]:
from sklearn.naive_bayes import GaussianNB

In [87]:
model=GaussianNB()

In [88]:
model.fit(X_train,Y_train)

GaussianNB()

In [89]:
model.score(X_test,Y_test)

0.7932960893854749

In [90]:
X_test[:10]

     Pclass        Age  female  male
624       3  21.000000       0     1
17        2  29.699118       0     1
228       2  18.000000       0     1
104       3  37.000000       0     1
611       3  29.699118       0     1
801       2  31.000000       1     0
330       3  29.699118       1     0
299       1  50.000000       1     0
673       2  31.000000       0     1
642       3   2.000000       1     0

In [91]:
Y_test[:10]

C:\Users\saite\AppData\Local\Temp\ipykernel_7528\418425187.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  Y_test[:10]

624    0
17     1
228    0
104    0
611    0
801    1
330    1
299    1
673    1
642    0
Name: Survived, dtype: int64

In [92]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 1, 1, 1, 0, 1], dtype=int64)

In [94]:
model.predict_proba(X_test[:10])

array([[0.97328339, 0.02671661],
       [0.94950516, 0.05049484],
       [0.93963052, 0.06036948],
       [0.97761636, 0.02238364],
       [0.97642599, 0.02357401],
       [0.01469732, 0.98530268],
       [0.03141034, 0.96858966],
       [0.00418913, 0.99581087],
       [0.95012976, 0.04987024],
       [0.01656322, 0.98343678]])

In [101]:
import pickle

In [103]:
with open ('TitanicNB','wb') as f:
    pickle.dump(model,f)

In [105]:
loaded_model=pickle.load(open(model)

TypeError: file must have 'read' and 'readline' attributes